# Task 4.6 Data Exporting and Combining

In [1]:
# importing libraries 
import pandas as pd
import numpy as np
import os

In [2]:
#import dataframes 
df_orders_products_combined=pd.read_pickle(r'/Users/ritviksolanki/Desktop/Instacart Basket Analysis /02 Data/Prepared Data/orders_products_combined.pkl')

Check the shape of both dataframes to make sure they are correct

In [3]:
df_orders_products_combined.shape

(32434489, 11)

In [19]:
df_orders_products_combined.shape

(32434489, 10)

In [4]:
df_orders_products_combined.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,prior,1,2,8,NaN,196,1,0,both
1,2539329,1,prior,1,2,8,NaN,14084,2,0,both
2,2539329,1,prior,1,2,8,NaN,12427,3,0,both
3,2539329,1,prior,1,2,8,NaN,26088,4,0,both
4,2539329,1,prior,1,2,8,NaN,26405,5,0,both

In [5]:
df_prods=pd.read_csv(r'/Users/ritviksolanki/Desktop/Instacart Basket Analysis /02 Data/Prepared Data/product_checked.csv',index_col=False)

In [6]:
df_prods.shape

(49693, 6)

In [7]:
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [8]:
# Drop any unamed columns in df_prods (not needed)
df_prods=df_prods.drop(columns=['Unnamed: 0'])

In [9]:
# Drop unamed columns from df_orders_products_combined
df_orders_products_combined = df_orders_products_combined.drop(columns = ['eval_set'])

In [10]:
df_orders_products_combined.shape

(32434489, 10)

In [11]:
df_orders_products_combined.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

5. Determine a suitable way to combine orders_products_combined and products dataset

In [13]:
# Merging the two datasets using the product_id column
df_ords_prods_merged=df_orders_products_combined.merge(df_prods,on ='product_id',indicator='merge_indicator')

6. Check the merge using the merge flag column

In [14]:
# checking df_ords_prods_merged datagrame 
df_ords_prods_merged.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,product_name,aisle_id,department_id,prices,merge_indicator
0,2539329,1,1,2,8,NaN,196,1,0,both,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,both,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,both,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,both,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,both,Soda,77,7,9.0,both

In [15]:
# checking the value counts in the _merge column
df_ords_prods_merged['_merge'].value_counts()

both          32434212
left_only            0
right_only           0
Name: _merge, dtype: int64

In [16]:
# Check the merged shape
df_ords_prods_merged.shape

(32434212, 15)

Question 7: Export the newly merged data using the pickle format

In [17]:
path=r'/Users/ritviksolanki/Desktop/Instacart Basket Analysis /02 Data/Prepared Data'

In [18]:
df_ords_prods_merged.to_pickle(os.path.join(path,'orders_products_merged.pkl'))

In [20]:
df_ords_prods_merged.shape

(32434212, 15)